Revit 2024 API
NavisworksExportOptions.ExportUrls Property
 True to export URL parameters, false otherwise. Default value is true.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public bool ExportUrls { get; set; }
Visual Basic
Public Property ExportUrls As Boolean
	Get
	Set
Visual C++
public:
property bool ExportUrls {
	bool get ();
	void set (bool value);
}
See Also
NavisworksExportOptions Class
Autodesk.Revit.DB Namespace